def handle_bot(message):
    message = message.strip()

    if message == "/start":
        return """
سلام بفرمایید

1️⃣ آیدی مالک
2️⃣ آیدی لیدر
3️⃣ ثبت سفارش
4️⃣ ثبت تبلیغ
5️⃣ ثبت نام در کلن
"""

    elif message == "آیدی مالک":
        return "@N8Abmin"

    elif message == "آیدی لیدر":
        return "لیدر خوابه 😴"

    elif message == "ثبت سفارش":
        return "به این پیام دهید:\n@N8Abmin"

    elif message == "ثبت تبلیغ":
        return "برای تبلیغات به آیدی زیر پیام دهید:\n@N8Abmin"

    elif message == "ثبت نام در کلن":
        return """
👑 ━━━━━━━ ⚡️ 𝐂𝐋𝐀𝐍 RT ⚡️ ━━━━━━━ 👑

آیا تو آماده‌ای تا به جمع برترین‌ها بپیوندی؟ 🤔

ما به دنبال بازیکنانی هستیم که فقط با بازی کردن، نمی‌خوان؛ بلکه می‌خوان حکمرانی کنن! 🔥

⚠️ شرایط ورود به جمع ما (بسیار مهم):

🔹 اسکین: داشتن حداقل ۷ اسکین متنوع و جذاب 🎭

🔹 تگ کلن: گذاشتن تگ اجباری 🏷

🔹 خودرو: داشتن ماشین‌های باکلاس 🚗

🔹 رنگ نمادین: طلایی (Gold) ✨👑

🔹 اخلاق: رعایت کامل ادب و احترام ❤️

🌐 جزئیات سرور:

📍 سرور کلن: ۳۰

💰 سیستم حقوق و دستمزد:

▫️ رتبه عادی: 20K 💵

▫️ رتبه کارآگاه: 40K 🕵️‍♂️

▫️ رتبه پلیس: 60K 👮‍♂️

برای ثبت نام 👇

@N8Abmin

@Amirrza13940
"""
    else:
        return "دستور نامعتبر است."
